import numpy as np
#(3,) : 벡터
x1 = np.array([1,2,3]) # x1에 123넣었다/teserflow가 잘 알아먹게하기위해 np를 썼다
print("x1 = ", x1.shape) #shape 구조를 확인하자 

x2 = np.array([[1,2,3]]) # (1,3) 
print("x2 = ", x2.shape) 

x3 = np.array([[1,2],[3,4]]) # (2,2)
print("x3 = ", x3.shape) # x3 = (2, 2)

x4 = np.array([[1,2],[3,4],[5,6]]) # (3,2) : 삼바이이 라고읽음
print("x4 = ", x4.shape)    

#x5 = np.array([[1,2],[3,4],[5,6,7]]) #이런데이터는 없다 !!! 
x5 = np.array([[[1,2],[3,4],[5,6,]]]) # 콤마 하나 더 찍어도 된다 
print("x5 = ", x5.shape) # (1, 3, 2) : 1개짜리 3개짜리 2개 

x6 = np.array([[[1,2,],[3,4,]],[[5,6,],[7,8,]]]) # (2, 2, 2) : 2개짜리 2개짜리 2개
print("x6 = ", x6.shape) 

x7 =  np.array([[[[[1,2,3,4,5],[6,7,8,9,10]]]]])
print("x7 = ", x7.shape)# x7 =  (1, 1, 1, 2, 5)

x8 = np.array([[[1,2,3]],[[4,5,6]]])
print("x8 = ", x8.shape) # x8 =  (2, 1, 3)

x9 = np.array([[[[1]]],[[[2]]]])
print("x9 = ", x9.shape) # x9 =  (2, 1, 1, 1)

# 2026.09.01 화요일 day2 메모
# 벡터 [1,2,3] -> (3,)
# 행렬 {[1,2,3] [4,5,6]} -> (2,3) #작은거부터 읽기 3개짜리 2개 
# 텐서 {{[1,2,3][4,5,6], [3,7,11][3,4,3]}} _> (2,2,3) # 3개짜리 2개가 2개있음